; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=110, out_folder=htg/blocksworld/training, instance_id=90, seed=2114

(define (problem blocksworld-90)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 b89 b90 b91 b92 b93 b94 b95 b96 b97 b98 b99 b100 b101 b102 b103 b104 b105 b106 b107 b108 b109 b110 - object)
 (:init 
    (arm-empty)
    (clear b54)
    (on b54 b36)
    (on b36 b58)
    (on b58 b56)
    (on b56 b21)
    (on b21 b59)
    (on b59 b62)
    (on-table b62)
    (clear b79)
    (on-table b79)
    (clear b10)
    (on b10 b57)
    (on b57 b24)
    (on b24 b95)
    (on b95 b14)
    (on b14 b84)
    (on b84 b42)
    (on b42 b75)
    (on b75 b11)
    (on b11 b41)
    (on b41 b83)
    (on b83 b72)
    (on b72 b65)
    (on b65 b49)
    (on b49 b53)
    (on b53 b22)
    (on b22 b108)
    (on b108 b105)
    (on b105 b51)
    (on b51 b87)
    (on b87 b29)
    (on b29 b80)
    (on b80 b40)
    (on b40 b52)
    (on b52 b96)
    (on b96 b77)
    (on b77 b85)
    (on b85 b25)
    (on-table b25)
    (clear b15)
    (on-table b15)
    (clear b88)
    (on-table b88)
    (clear b89)
    (on b89 b12)
    (on b12 b47)
    (on b47 b18)
    (on b18 b37)
    (on b37 b34)
    (on b34 b61)
    (on b61 b45)
    (on b45 b46)
    (on b46 b27)
    (on b27 b104)
    (on b104 b23)
    (on b23 b30)
    (on b30 b97)
    (on b97 b55)
    (on b55 b107)
    (on b107 b103)
    (on b103 b2)
    (on b2 b39)
    (on b39 b4)
    (on b4 b90)
    (on b90 b91)
    (on b91 b67)
    (on b67 b16)
    (on b16 b73)
    (on b73 b76)
    (on b76 b50)
    (on b50 b71)
    (on b71 b102)
    (on b102 b93)
    (on b93 b48)
    (on-table b48)
    (clear b81)
    (on b81 b5)
    (on b5 b19)
    (on b19 b100)
    (on-table b100)
    (clear b6)
    (on b6 b98)
    (on b98 b70)
    (on b70 b78)
    (on b78 b13)
    (on-table b13)
    (clear b92)
    (on b92 b74)
    (on b74 b68)
    (on b68 b1)
    (on b1 b8)
    (on b8 b94)
    (on b94 b82)
    (on-table b82)
    (clear b106)
    (on b106 b63)
    (on b63 b38)
    (on b38 b9)
    (on b9 b43)
    (on b43 b3)
    (on b3 b109)
    (on b109 b17)
    (on-table b17)
    (clear b20)
    (on b20 b33)
    (on b33 b101)
    (on b101 b44)
    (on b44 b69)
    (on-table b69)
    (clear b32)
    (on b32 b26)
    (on b26 b7)
    (on b7 b35)
    (on b35 b64)
    (on b64 b99)
    (on b99 b66)
    (on b66 b110)
    (on b110 b60)
    (on b60 b86)
    (on b86 b28)
    (on b28 b31)
    (on-table b31))
 (:goal  (and 
    (clear b8)
    (on b8 b9)
    (on b9 b7)
    (on b7 b6)
    (on b6 b5)
    (on b5 b4)
    (on b4 b3)
    (on b3 b10)
    (on b10 b11)
    (on-table b11)
    (clear b2)
    (on b2 b1)
    (on-table b1))))

; plan
1. (unstack b81 b5)
   deleted: (on b81 b5) (clear b81) (arm-empty)
   added: (holding b81) (clear b5)
   goals met: 0 of 13
2. (putdown b81)
   deleted: (holding b81)
   added: (clear b81) (arm-empty) (on-table b81)
   goals met: 0 of 13
3. (unstack b6 b98)
   deleted: (on b6 b98) (clear b6) (arm-empty)
   added: (holding b6) (clear b98)
   goals met: 0 of 13
4. (stack b6 b5)
   deleted: (clear b5) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b5)
   goals met: 1 of 13
5. (unstack b32 b26)
   deleted: (on b32 b26) (clear b32) (arm-empty)
   added: (holding b32) (clear b26)
   goals met: 1 of 13
6. (putdown b32)
   deleted: (holding b32)
   added: (clear b32) (arm-empty) (on-table b32)
   goals met: 1 of 13
7. (unstack b26 b7)
   deleted: (on b26 b7) (clear b26) (arm-empty)
   added: (holding b26) (clear b7)
   goals met: 1 of 13
8. (putdown b26)
   deleted: (holding b26)
   added: (clear b26) (arm-empty) (on-table b26)
   goals met: 1 of 13
9. (unstack b7 b35)
   deleted: (on b7 b35) (clear b7) (arm-empty)
   added: (holding b7) (clear b35)
   goals met: 1 of 13
10. (stack b7 b6)
   deleted: (clear b6) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b6)
   goals met: 2 of 13
11. (unstack b92 b74)
   deleted: (on b92 b74) (clear b92) (arm-empty)
   added: (holding b92) (clear b74)
   goals met: 2 of 13
12. (putdown b92)
   deleted: (holding b92)
   added: (clear b92) (arm-empty) (on-table b92)
   goals met: 2 of 13
13. (unstack b74 b68)
   deleted: (on b74 b68) (clear b74) (arm-empty)
   added: (holding b74) (clear b68)
   goals met: 2 of 13
14. (putdown b74)
   deleted: (holding b74)
   added: (clear b74) (arm-empty) (on-table b74)
   goals met: 2 of 13
15. (unstack b68 b1)
   deleted: (on b68 b1) (clear b68) (arm-empty)
   added: (holding b68) (clear b1)
   goals met: 2 of 13
16. (putdown b68)
   deleted: (holding b68)
   added: (clear b68) (arm-empty) (on-table b68)
   goals met: 2 of 13
17. (unstack b1 b8)
   deleted: (on b1 b8) (clear b1) (arm-empty)
   added: (holding b1) (clear b8)
   goals met: 3 of 13
18. (putdown b1)
   deleted: (holding b1)
   added: (clear b1) (arm-empty) (on-table b1)
   goals met: 4 of 13
19. (unstack b106 b63)
   deleted: (on b106 b63) (clear b106) (arm-empty)
   added: (holding b106) (clear b63)
   goals met: 4 of 13
20. (putdown b106)
   deleted: (holding b106)
   added: (clear b106) (arm-empty) (on-table b106)
   goals met: 4 of 13
21. (unstack b63 b38)
   deleted: (on b63 b38) (clear b63) (arm-empty)
   added: (holding b63) (clear b38)
   goals met: 4 of 13
22. (putdown b63)
   deleted: (holding b63)
   added: (clear b63) (arm-empty) (on-table b63)
   goals met: 4 of 13
23. (unstack b38 b9)
   deleted: (on b38 b9) (clear b38) (arm-empty)
   added: (holding b38) (clear b9)
   goals met: 4 of 13
24. (putdown b38)
   deleted: (holding b38)
   added: (clear b38) (arm-empty) (on-table b38)
   goals met: 4 of 13
25. (unstack b9 b43)
   deleted: (on b9 b43) (clear b9) (arm-empty)
   added: (holding b9) (clear b43)
   goals met: 4 of 13
26. (stack b9 b7)
   deleted: (clear b7) (holding b9)
   added: (arm-empty) (clear b9) (on b9 b7)
   goals met: 5 of 13
27. (unstack b8 b94)
   deleted: (on b8 b94) (clear b8) (arm-empty)
   added: (holding b8) (clear b94)
   goals met: 4 of 13
28. (stack b8 b9)
   deleted: (clear b9) (holding b8)
   added: (arm-empty) (clear b8) (on b8 b9)
   goals met: 6 of 13
29. (unstack b43 b3)
   deleted: (on b43 b3) (clear b43) (arm-empty)
   added: (holding b43) (clear b3)
   goals met: 6 of 13
30. (putdown b43)
   deleted: (holding b43)
   added: (clear b43) (arm-empty) (on-table b43)
   goals met: 6 of 13
31. (unstack b3 b109)
   deleted: (on b3 b109) (clear b3) (arm-empty)
   added: (holding b3) (clear b109)
   goals met: 6 of 13
32. (stack b3 b10)
   deleted: (clear b10) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b10)
   goals met: 7 of 13
33. (unstack b89 b12)
   deleted: (on b89 b12) (clear b89) (arm-empty)
   added: (holding b89) (clear b12)
   goals met: 7 of 13
34. (putdown b89)
   deleted: (holding b89)
   added: (clear b89) (arm-empty) (on-table b89)
   goals met: 7 of 13
35. (unstack b12 b47)
   deleted: (on b12 b47) (clear b12) (arm-empty)
   added: (holding b12) (clear b47)
   goals met: 7 of 13
36. (putdown b12)
   deleted: (holding b12)
   added: (clear b12) (arm-empty) (on-table b12)
   goals met: 7 of 13
37. (unstack b47 b18)
   deleted: (on b47 b18) (clear b47) (arm-empty)
   added: (holding b47) (clear b18)
   goals met: 7 of 13
38. (putdown b47)
   deleted: (holding b47)
   added: (clear b47) (arm-empty) (on-table b47)
   goals met: 7 of 13
39. (unstack b18 b37)
   deleted: (on b18 b37) (clear b18) (arm-empty)
   added: (holding b18) (clear b37)
   goals met: 7 of 13
40. (putdown b18)
   deleted: (holding b18)
   added: (clear b18) (arm-empty) (on-table b18)
   goals met: 7 of 13
41. (unstack b37 b34)
   deleted: (on b37 b34) (clear b37) (arm-empty)
   added: (holding b37) (clear b34)
   goals met: 7 of 13
42. (putdown b37)
   deleted: (holding b37)
   added: (clear b37) (arm-empty) (on-table b37)
   goals met: 7 of 13
43. (unstack b34 b61)
   deleted: (on b34 b61) (clear b34) (arm-empty)
   added: (holding b34) (clear b61)
   goals met: 7 of 13
44. (putdown b34)
   deleted: (holding b34)
   added: (clear b34) (arm-empty) (on-table b34)
   goals met: 7 of 13
45. (unstack b61 b45)
   deleted: (on b61 b45) (clear b61) (arm-empty)
   added: (holding b61) (clear b45)
   goals met: 7 of 13
46. (putdown b61)
   deleted: (holding b61)
   added: (clear b61) (arm-empty) (on-table b61)
   goals met: 7 of 13
47. (unstack b45 b46)
   deleted: (on b45 b46) (clear b45) (arm-empty)
   added: (holding b45) (clear b46)
   goals met: 7 of 13
48. (putdown b45)
   deleted: (holding b45)
   added: (clear b45) (arm-empty) (on-table b45)
   goals met: 7 of 13
49. (unstack b46 b27)
   deleted: (on b46 b27) (clear b46) (arm-empty)
   added: (holding b46) (clear b27)
   goals met: 7 of 13
50. (putdown b46)
   deleted: (holding b46)
   added: (clear b46) (arm-empty) (on-table b46)
   goals met: 7 of 13
51. (unstack b27 b104)
   deleted: (on b27 b104) (clear b27) (arm-empty)
   added: (holding b27) (clear b104)
   goals met: 7 of 13
52. (putdown b27)
   deleted: (holding b27)
   added: (clear b27) (arm-empty) (on-table b27)
   goals met: 7 of 13
53. (unstack b104 b23)
   deleted: (on b104 b23) (clear b104) (arm-empty)
   added: (holding b104) (clear b23)
   goals met: 7 of 13
54. (putdown b104)
   deleted: (holding b104)
   added: (clear b104) (arm-empty) (on-table b104)
   goals met: 7 of 13
55. (unstack b23 b30)
   deleted: (on b23 b30) (clear b23) (arm-empty)
   added: (holding b23) (clear b30)
   goals met: 7 of 13
56. (putdown b23)
   deleted: (holding b23)
   added: (clear b23) (arm-empty) (on-table b23)
   goals met: 7 of 13
57. (unstack b30 b97)
   deleted: (on b30 b97) (clear b30) (arm-empty)
   added: (holding b30) (clear b97)
   goals met: 7 of 13
58. (putdown b30)
   deleted: (holding b30)
   added: (clear b30) (arm-empty) (on-table b30)
   goals met: 7 of 13
59. (unstack b97 b55)
   deleted: (on b97 b55) (clear b97) (arm-empty)
   added: (holding b97) (clear b55)
   goals met: 7 of 13
60. (putdown b97)
   deleted: (holding b97)
   added: (clear b97) (arm-empty) (on-table b97)
   goals met: 7 of 13
61. (unstack b55 b107)
   deleted: (on b55 b107) (clear b55) (arm-empty)
   added: (holding b55) (clear b107)
   goals met: 7 of 13
62. (putdown b55)
   deleted: (holding b55)
   added: (clear b55) (arm-empty) (on-table b55)
   goals met: 7 of 13
63. (unstack b107 b103)
   deleted: (on b107 b103) (clear b107) (arm-empty)
   added: (holding b107) (clear b103)
   goals met: 7 of 13
64. (putdown b107)
   deleted: (holding b107)
   added: (clear b107) (arm-empty) (on-table b107)
   goals met: 7 of 13
65. (unstack b103 b2)
   deleted: (on b103 b2) (clear b103) (arm-empty)
   added: (holding b103) (clear b2)
   goals met: 8 of 13
66. (putdown b103)
   deleted: (holding b103)
   added: (clear b103) (arm-empty) (on-table b103)
   goals met: 8 of 13
67. (unstack b2 b39)
   deleted: (on b2 b39) (clear b2) (arm-empty)
   added: (holding b2) (clear b39)
   goals met: 7 of 13
68. (stack b2 b1)
   deleted: (clear b1) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b1)
   goals met: 9 of 13
69. (unstack b39 b4)
   deleted: (on b39 b4) (clear b39) (arm-empty)
   added: (holding b39) (clear b4)
   goals met: 9 of 13
70. (stack b39 b107)
   deleted: (clear b107) (holding b39)
   added: (arm-empty) (clear b39) (on b39 b107)
   goals met: 9 of 13
71. (unstack b3 b10)
   deleted: (on b3 b10) (clear b3) (arm-empty)
   added: (holding b3) (clear b10)
   goals met: 8 of 13
72. (stack b3 b104)
   deleted: (clear b104) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b104)
   goals met: 8 of 13
73. (unstack b4 b90)
   deleted: (on b4 b90) (clear b4) (arm-empty)
   added: (holding b4) (clear b90)
   goals met: 8 of 13
74. (stack b4 b3)
   deleted: (clear b3) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b3)
   goals met: 9 of 13
75. (unstack b10 b57)
   deleted: (on b10 b57) (clear b10) (arm-empty)
   added: (holding b10) (clear b57)
   goals met: 9 of 13
76. (putdown b10)
   deleted: (holding b10)
   added: (clear b10) (arm-empty) (on-table b10)
   goals met: 9 of 13
77. (unstack b57 b24)
   deleted: (on b57 b24) (clear b57) (arm-empty)
   added: (holding b57) (clear b24)
   goals met: 9 of 13
78. (putdown b57)
   deleted: (holding b57)
   added: (clear b57) (arm-empty) (on-table b57)
   goals met: 9 of 13
79. (unstack b24 b95)
   deleted: (on b24 b95) (clear b24) (arm-empty)
   added: (holding b24) (clear b95)
   goals met: 9 of 13
80. (putdown b24)
   deleted: (holding b24)
   added: (clear b24) (arm-empty) (on-table b24)
   goals met: 9 of 13
81. (unstack b95 b14)
   deleted: (on b95 b14) (clear b95) (arm-empty)
   added: (holding b95) (clear b14)
   goals met: 9 of 13
82. (putdown b95)
   deleted: (holding b95)
   added: (clear b95) (arm-empty) (on-table b95)
   goals met: 9 of 13
83. (unstack b14 b84)
   deleted: (on b14 b84) (clear b14) (arm-empty)
   added: (holding b14) (clear b84)
   goals met: 9 of 13
84. (putdown b14)
   deleted: (holding b14)
   added: (clear b14) (arm-empty) (on-table b14)
   goals met: 9 of 13
85. (unstack b84 b42)
   deleted: (on b84 b42) (clear b84) (arm-empty)
   added: (holding b84) (clear b42)
   goals met: 9 of 13
86. (putdown b84)
   deleted: (holding b84)
   added: (clear b84) (arm-empty) (on-table b84)
   goals met: 9 of 13
87. (unstack b42 b75)
   deleted: (on b42 b75) (clear b42) (arm-empty)
   added: (holding b42) (clear b75)
   goals met: 9 of 13
88. (putdown b42)
   deleted: (holding b42)
   added: (clear b42) (arm-empty) (on-table b42)
   goals met: 9 of 13
89. (unstack b75 b11)
   deleted: (on b75 b11) (clear b75) (arm-empty)
   added: (holding b75) (clear b11)
   goals met: 9 of 13
90. (putdown b75)
   deleted: (holding b75)
   added: (clear b75) (arm-empty) (on-table b75)
   goals met: 9 of 13
91. (unstack b11 b41)
   deleted: (on b11 b41) (clear b11) (arm-empty)
   added: (holding b11) (clear b41)
   goals met: 9 of 13
92. (putdown b11)
   deleted: (holding b11)
   added: (clear b11) (arm-empty) (on-table b11)
   goals met: 10 of 13
93. (pickup b10)
   deleted: (clear b10) (on-table b10) (arm-empty)
   added: (holding b10)
   goals met: 10 of 13
94. (stack b10 b11)
   deleted: (clear b11) (holding b10)
   added: (arm-empty) (clear b10) (on b10 b11)
   goals met: 11 of 13
95. (unstack b4 b3)
   deleted: (on b4 b3) (clear b4) (arm-empty)
   added: (holding b4) (clear b3)
   goals met: 10 of 13
96. (putdown b4)
   deleted: (holding b4)
   added: (clear b4) (arm-empty) (on-table b4)
   goals met: 10 of 13
97. (unstack b3 b104)
   deleted: (on b3 b104) (clear b3) (arm-empty)
   added: (holding b3) (clear b104)
   goals met: 10 of 13
98. (stack b3 b10)
   deleted: (clear b10) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b10)
   goals met: 11 of 13
99. (pickup b4)
   deleted: (clear b4) (on-table b4) (arm-empty)
   added: (holding b4)
   goals met: 11 of 13
100. (stack b4 b3)
   deleted: (clear b3) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b3)
   goals met: 12 of 13
101. (unstack b8 b9)
   deleted: (on b8 b9) (clear b8) (arm-empty)
   added: (holding b8) (clear b9)
   goals met: 10 of 13
102. (putdown b8)
   deleted: (holding b8)
   added: (clear b8) (arm-empty) (on-table b8)
   goals met: 11 of 13
103. (unstack b9 b7)
   deleted: (on b9 b7) (clear b9) (arm-empty)
   added: (holding b9) (clear b7)
   goals met: 10 of 13
104. (putdown b9)
   deleted: (holding b9)
   added: (clear b9) (arm-empty) (on-table b9)
   goals met: 10 of 13
105. (pickup b8)
   deleted: (clear b8) (on-table b8) (arm-empty)
   added: (holding b8)
   goals met: 9 of 13
106. (stack b8 b9)
   deleted: (clear b9) (holding b8)
   added: (arm-empty) (clear b8) (on b8 b9)
   goals met: 11 of 13
107. (unstack b7 b6)
   deleted: (on b7 b6) (clear b7) (arm-empty)
   added: (holding b7) (clear b6)
   goals met: 10 of 13
108. (putdown b7)
   deleted: (holding b7)
   added: (clear b7) (arm-empty) (on-table b7)
   goals met: 10 of 13
109. (unstack b6 b5)
   deleted: (on b6 b5) (clear b6) (arm-empty)
   added: (holding b6) (clear b5)
   goals met: 9 of 13
110. (putdown b6)
   deleted: (holding b6)
   added: (clear b6) (arm-empty) (on-table b6)
   goals met: 9 of 13
111. (unstack b5 b19)
   deleted: (on b5 b19) (clear b5) (arm-empty)
   added: (holding b5) (clear b19)
   goals met: 9 of 13
112. (stack b5 b4)
   deleted: (clear b4) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b4)
   goals met: 10 of 13
113. (pickup b6)
   deleted: (clear b6) (on-table b6) (arm-empty)
   added: (holding b6)
   goals met: 10 of 13
114. (stack b6 b5)
   deleted: (clear b5) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b5)
   goals met: 11 of 13
115. (pickup b7)
   deleted: (clear b7) (on-table b7) (arm-empty)
   added: (holding b7)
   goals met: 11 of 13
116. (stack b7 b6)
   deleted: (clear b6) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b6)
   goals met: 12 of 13
117. (unstack b8 b9)
   deleted: (on b8 b9) (clear b8) (arm-empty)
   added: (holding b8) (clear b9)
   goals met: 10 of 13
118. (putdown b8)
   deleted: (holding b8)
   added: (clear b8) (arm-empty) (on-table b8)
   goals met: 11 of 13
119. (pickup b9)
   deleted: (clear b9) (on-table b9) (arm-empty)
   added: (holding b9)
   goals met: 11 of 13
120. (stack b9 b7)
   deleted: (clear b7) (holding b9)
   added: (arm-empty) (clear b9) (on b9 b7)
   goals met: 12 of 13
121. (pickup b8)
   deleted: (clear b8) (on-table b8) (arm-empty)
   added: (holding b8)
   goals met: 11 of 13
122. (stack b8 b9)
   deleted: (clear b9) (holding b8)
   added: (arm-empty) (clear b8) (on b8 b9)
   goals met: 13 of 13
